---
type: MEPAnalyticalNode
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 7
tags: [revit-api, class]
---

# MEPAnalyticalNode

`Autodesk.Revit.DB.Analysis.MEPAnalyticalNode` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsSameNode | 2024 | `public bool IsSameNode ( MEPAnalyticalNode other )` |
| Property | Id | 2024 | `public int Id { get ; }` |
| Property | IsFlowBlocked | 2024 | `public bool IsFlowBlocked { get ; }` |
| Property | IsFocalNode | 2024 | `public bool IsFocalNode { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Location | 2024 | `public XYZ Location { get ; }` |